Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_eth.c
  /*-------------------------------- MAC Initialization ----------------------*/
  /* Get the ETHERNET MACMIIAR value */
  tmpreg1 = (heth->Instance)->MACMIIAR;
  /* Clear CSR Clock Range CR[2:0] bits */
  tmpreg1 &= ETH_MACMIIAR_CR_MASK;

  /* Get hclk frequency value */
  hclk = HAL_RCC_GetHCLKFreq();

  /* Set CR bits depending on hclk value */
  if ((hclk >= 20000000U) && (hclk < 35000000U))
  {
    /* CSR Clock Range between 20-35 MHz */
    tmpreg1 |= (uint32_t)ETH_MACMIIAR_CR_DIV16;
  }
  else if ((hclk >= 35000000U) && (hclk < 60000000U))
  {
    /* CSR Clock Range between 35-60 MHz */
    tmpreg1 |= (uint32_t)ETH_MACMIIAR_CR_DIV26;
  }
  else
  {
    /* CSR Clock Range between 60-72 MHz */
    tmpreg1 |= (uint32_t)ETH_MACMIIAR_CR_DIV42;
  }

  /* Write to ETHERNET MAC MIIAR: Configure the ETHERNET CSR Clock Range */
  (heth->Instance)->MACMIIAR = (uint32_t)tmpreg1;

  /*-------------------- PHY initialization and configuration ----------------*/
#ifndef PHY_LOOP_BACK
  /* Put the PHY in reset mode */
  if(heth->Init.MediaInterface == ETH_MEDIA_INTERFACE_MII)
  {
    HAL_ETH_ReadPHYRegister(heth, PHY_BSR, &phyreg);
    HAL_ETH_ReadPHYRegister(heth, PHY_BCR, &phyreg);
  }
  if ((HAL_ETH_WritePHYRegister(heth, PHY_BCR, PHY_RESET)) != HAL_OK)
  {
    /* In case of write timeout */
    err = ETH_ERROR;

    /* Config MAC and DMA */
    ETH_MACDMAConfig(heth, err);

    /* Set the ETH peripheral state to READY */
    heth->State = HAL_ETH_STATE_READY;

    /* Return HAL_ERROR */
    return HAL_ERROR;
  }
  if(heth->Init.MediaInterface == ETH_MEDIA_INTERFACE_MII)
  {
    HAL_ETH_ReadPHYRegister(heth, PHY_BSR, &phyreg);
    HAL_ETH_ReadPHYRegister(heth, PHY_BCR, &phyreg);
  }
  /* Delay to assure PHY reset */
  HAL_Delay(PHY_RESET_DELAY);

  if ((heth->Init).AutoNegotiation != ETH_AUTONEGOTIATION_DISABLE)
  {
    /* Get tick */
    tickstart = HAL_GetTick();

    /* We wait for linked status */
    do
    {
      HAL_ETH_ReadPHYRegister(heth, PHY_BSR, &phyreg);

      /* Check for the Timeout */
      if ((HAL_GetTick() - tickstart) > ETH_TIMEOUT_LINKED_STATE)
      {
        /* In case of write timeout */
        err = ETH_ERROR;

        /* Config MAC and DMA */
        ETH_MACDMAConfig(heth, err);

        heth->State = HAL_ETH_STATE_READY;

        /* Process Unlocked */
        __HAL_UNLOCK(heth);

        return HAL_TIMEOUT;
      }
    }
    while (((phyreg & PHY_LINKED_STATUS) != PHY_LINKED_STATUS));

    if(heth->Init.MediaInterface != ETH_MEDIA_INTERFACE_MII)
    {
      /* Enable Auto-Negotiation */
      if ((HAL_ETH_WritePHYRegister(heth, PHY_BCR, PHY_AUTONEGOTIATION)) != HAL_OK)
      {
        /* In case of write timeout */
        err = ETH_ERROR;

        /* Config MAC and DMA */
        ETH_MACDMAConfig(heth, err);

        /* Set the ETH peripheral state to READY */
        heth->State = HAL_ETH_STATE_READY;

        /* Return HAL_ERROR */
        return HAL_ERROR;
      }

      /* Get tick */
      tickstart = HAL_GetTick();

      /* Wait until the auto-negotiation will be completed */
      do
      {
        HAL_ETH_ReadPHYRegister(heth, PHY_BSR, &phyreg);

        /* Check for the Timeout */
        if ((HAL_GetTick() - tickstart) > ETH_TIMEOUT_AUTONEGO_COMPLETED)
        {
          /* In case of write timeout */
          err = ETH_ERROR;

          /* Config MAC and DMA */
          ETH_MACDMAConfig(heth, err);

          heth->State = HAL_ETH_STATE_READY;

          /* Process Unlocked */
          __HAL_UNLOCK(heth);

          return HAL_TIMEOUT;
        }

      }
      while (((phyreg & PHY_AUTONEGO_COMPLETE) != PHY_AUTONEGO_COMPLETE));
    }
    /* Read the result of the auto-negotiation */
    if (((HAL_ETH_ReadPHYRegister(heth, PHY_SR, &phyreg)) != HAL_OK) || ((HAL_ETH_ReadPHYRegister(heth, PHY_BCR, &phyreg)) != HAL_OK))
    {
      /* In case of write timeout */
      err = ETH_ERROR;

      /* Config MAC and DMA */
      ETH_MACDMAConfig(heth, err);

      /* Set the ETH peripheral state to READY */
      heth->State = HAL_ETH_STATE_READY;

      /* Return HAL_ERROR */
      return HAL_ERROR;
    }

    /* Configure the MAC with the Duplex Mode fixed by the auto-negotiation process */
    if (((phyreg & PHY_DUPLEX_STATUS) != (uint32_t)RESET) || ((phyreg & (1<<8)) != (uint32_t)RESET))
    {
      /* Set Ethernet duplex mode to Full-duplex following the auto-negotiation */
      (heth->Init).DuplexMode = ETH_MODE_FULLDUPLEX;
    }
    else
    {
      /* Set Ethernet duplex mode to Half-duplex following the auto-negotiation */
      (heth->Init).DuplexMode = ETH_MODE_HALFDUPLEX;
    }
    /* Configure the MAC with the speed fixed by the auto-negotiation process */
    if (((phyreg & PHY_SPEED_STATUS) == PHY_SPEED_STATUS) || ((phyreg & (1<<13)) == PHY_SPEED_STATUS))
    {
      /* Set Ethernet speed to 10M following the auto-negotiation */
      (heth->Init).Speed = ETH_SPEED_10M;
    }
    else
    {
      /* Set Ethernet speed to 100M following the auto-negotiation */
      (heth->Init).Speed = ETH_SPEED_100M;
    }
  }
  else /* AutoNegotiation Disable */
  {
    if(heth->Init.MediaInterface != ETH_MEDIA_INTERFACE_MII)
    {
      /* Check parameters */
      assert_param(IS_ETH_SPEED(heth->Init.Speed));
      assert_param(IS_ETH_DUPLEX_MODE(heth->Init.DuplexMode));

      /* Set MAC Speed and Duplex Mode */
      if (HAL_ETH_WritePHYRegister(heth, PHY_BCR, ((uint16_t)((heth->Init).DuplexMode >> 3U) |
                                                   (uint16_t)((heth->Init).Speed >> 1U))) != HAL_OK)
      {
        /* In case of write timeout */
        err = ETH_ERROR;

        /* Config MAC and DMA */
        ETH_MACDMAConfig(heth, err);

        /* Set the ETH peripheral state to READY */
        heth->State = HAL_ETH_STATE_READY;

        /* Return HAL_ERROR */
        return HAL_ERROR;
      }

      /* Delay to assure PHY configuration */
      HAL_Delay(PHY_CONFIG_DELAY);
    }
  }
#endif
  /* Config MAC and DMA */
  ETH_MACDMAConfig(heth, err);

  /* Set ETH HAL State to Ready */
  heth->State = HAL_ETH_STATE_READY;

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  De-Initializes the ETH peripheral.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETH_DeInit(ETH_HandleTypeDef *heth)
{
  /* Set the ETH peripheral state to BUSY */
  heth->State = HAL_ETH_STATE_BUSY;

#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
  if (heth->MspDeInitCallback == NULL)
  {
    heth->MspDeInitCallback = HAL_ETH_MspDeInit;
  }
  /* De-Init the low level hardware : GPIO, CLOCK, NVIC. */
  heth->MspDeInitCallback(heth);
#else
  /* De-Init the low level hardware : GPIO, CLOCK, NVIC. */
  HAL_ETH_MspDeInit(heth);
#endif

